dastin-alex/esp8266_test/src/main.cpp
#include "esp8266_test.h"

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
//                                                             ФУНКЦИИ-ПРОЦЕССЫ
// бесконечное исполнение                                                 setup
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

void setup()

{

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // периодический вывод в UART значения времени                                 timescan
  // включение UART, модуля WiFi. подключение к сети по UDP
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// TS00
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // включение, настройка UART
  // начало печати отчёта
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  Serial.begin(9600);          // МЕТОД Serial.begin : скорость 9600 бод
  Serial.println();            // МЕТОД Serial.println
  Serial.println();            // МЕТОД Serial.println
  Serial.print("connect to "); // МЕТОД Serial.print
  Serial.println(ssid);        // МЕТОД Serial.println : значение SSID

  /////////////////////////////////////////////////////////////////////////////// TS01
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // включение модуля WIFI. режим station mode.
  // регистрация в сети WIFI
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  WiFi.mode(WIFI_STA);    // МЕТОД WiFi.mode  : режим station mode
  WiFi.begin(ssid, pass); // МЕТОД WiFi.begin : регистрация в сети WIFI

  /////////////////////////////////////////////////////////////////////////////// TS02
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // цикл опроса состояния соединения.
  // ПОКА состояние соединения != WL_CONNECTED: ТО пауза ожидания 500
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  while (WiFi.status() != WL_CONNECTED) // WiFi.status : состояние соединения

  {

    /////////////////////////////////////////////////////////////////////////////// TS03
    // ---------------------------------------------------------------------- delay 500
    //                                                                       ЗАДАЧА
    // пауза ожидания 50 мсек
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    delay(500);
    Serial.print("."); // МЕТОД Serial.print
  }

  /////////////////////////////////////////////////////////////////////////////// TS04
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // начало сеанса работы по протоколу UDP
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  udp.begin(localPort); // МЕТОД udp.begin

  /////////////////////////////////////////////////////////////////////////////// TS05
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // печать в UART отчёта.
  // информация о подключении к сети WIFI
  // информация о настройке протокола UDP
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  Serial.println("");               // МЕТОД Serial.println
  Serial.println("WIFI connected"); // МЕТОД Serial.println
  Serial.print("IP address: ");     // МЕТОД Serial.print
  Serial.println(WiFi.localIP());   // МЕТОД Serial.println, WiFi.localIP
  Serial.print("Local port: ");     // МЕТОД Serial.print
  Serial.println(udp.localPort());  // МЕТОД Serial.println, udp.localPort
  Serial.println("");               // МЕТОД Serial.println

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // непрерывная световая сигнализация                                              blink
  // начальная настройка контакта встроенного светодиода LED_BUILTIN
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// BL00
  // ----------------------------------------------------------------------------
  // начальная настройка
  // контакт встроенного светодиода LED_BUILTIN
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  pinMode(LED_BUILTIN, OUTPUT); // светодиод. режим OUTPUT

