dastin-alex/esp8266_test/src/main.cpp
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // контроль нажатия встроенной кнопки                                          keypress
  // начальная настройка контакта встроенной кнопки FLASH
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// KP00
  // ----------------------------------------------------------------------------
  // начальная настройка
  // контакт встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  pinMode(15, INPUT_PULLUP); // кнопка. режим INPUT_PULLUP
}

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
//                                                             ФУНКЦИИ-ПРОЦЕССЫ
// бесконечное исполнение                                                  loop
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

void loop()

{

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // периодический вывод в UART значения времени,                                timescan
  // полученного от сервера времени NTP
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// TS06
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // подключение к сети WIFI.
  // случайный выбор сервера NTP из пула
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  WiFi.hostByName(ntpServerName, timeServerIP); // МЕТОД WiFi.hostByName

  /////////////////////////////////////////////////////////////////////////////// TS07
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // начальная установка битовых полей пакета запроса времени NTP.
  // установка всех байтов буфера пакета в 0.
  // установка необходимых байтов буфера пакета.
  // байты 4 .. 11 (8 байтов) соответствуют полям Root Delay и Root Dispersion
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  memset(packetBuffer, 0, NTP_PACKET_SIZE);

  packetBuffer[0] = 0b11100011; // LI, версия, режим
  packetBuffer[1] = 0;          // уровень или тип часов
  packetBuffer[2] = 6;          // интервал
  packetBuffer[3] = 0xEC;       // точность (Peer Clock Precision)

  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;

  /////////////////////////////////////////////////////////////////////////////// TS08
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // пакет запроса времени NTP сформирован.
  // отправка пакета NTP в выбранный сервер времени.
  // передача пакета в порт 123.
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  udp.beginPacket(timeServerIP, 123);       // МЕТОД udp.beginPacket
  udp.write(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.write
  udp.endPacket();                          // МЕТОД udp.endPacket

  /////////////////////////////////////////////////////////////////////////////// TS09
  // ---------------------------------------------------------------------- delay 1000
  //                                                                       ЗАДАЧА
  // ожидается ответ сервера на запрос
  // пауза ожидания ответа севера 100 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  delay(1000);

  /////////////////////////////////////////////////////////////////////////////// TS10
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // попытка разобрать пакет UDP
  // синтаксический разбор результата, полученного из сети WIFI.
  // ЕСЛИ длина пакета = 0 : ТО пакет UDP не принят
  // ЕСЛИ длина пакета != 0 : ТО пакет UDP получен
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  cb = udp.parsePacket(); // МЕТОД udp.parsePacket

  if (cb)

  {

    /////////////////////////////////////////////////////////////////////////////// TS11
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // сохранение полученного пакета в буфер
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    udp.read(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.read

    /////////////////////////////////////////////////////////////////////////////// TS12
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // длина битового поля информации о времени равна четырем байтам (два слова).
    // начинается с 40-го байта принятого пакета.
    // старшее слово - байты 40 .. 41
    // младшее слов0 - байты 42 .. 43
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    highWord = word(packetBuffer[40], packetBuffer[41]);
    lowWord = word(packetBuffer[42], packetBuffer[43]);

    /////////////////////////////////////////////////////////////////////////////// TS13
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // время NTP. количество секунд, прошедших с даты Jan 1 1900
    // объединение четырех байтов в одно длинное целое число
    // время UNIX. количество секунд, прошедших с даты Jan 1 1970
    // вычитание из времени NTP количества секунд в 70 годах
    // время GMT+3. значение времени UNIX в Москве
    // прибавление к времени UNIX количества секунд в tdelta часах
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    secsSince1900 = highWord << 16 | lowWord;
    epoch = secsSince1900 - seventyYears;
    gmt3 = epoch + tdelta * 3600;

