dastin-alex/esp8266_test/src/main.cpp
    /////////////////////////////////////////////////////////////////////////////// TS14
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о результатах расчёта времени
    // время GMT соответствует меридиану Гринвича (Greenwich Meridian time)
    // время GMT+3 соответствует текущему времени в Москве
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    Serial.print("packet length = "); // МЕТОД Serial.print
    Serial.println(cb);               // МЕТОД Serial.println
    Serial.print("NTP time   = ");    // МЕТОД Serial.print
    Serial.println(secsSince1900);    // МЕТОД Serial.println
    Serial.print("GMT time   = ");    // МЕТОД Serial.print
    Serial.println(epoch);            // МЕТОД Serial.println
    Serial.print("GMT+3 time = ");    // МЕТОД Serial.print
    Serial.println(gmt3);             // МЕТОД Serial.println

    /////////////////////////////////////////////////////////////////////////////// TS15
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // расчёт числа часов, минут, секунд времени GMT+3.
    // применяется формат HH:MM:SS
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    thrs = int((gmt3 % secsDay) / 3600);
    tmin = int((gmt3 % 3600) / 60);
    tsec = int(gmt3 % 60);

    /////////////////////////////////////////////////////////////////////////////// TS16
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве часов для времени GMT+3.
    // ЕСЛИ число часов < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    Serial.print("Moscow time is "); // МЕТОД Serial.print

    if (thrs < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.print(thrs); // МЕТОД Serial.print
    Serial.print(':');  // МЕТОД Serial.print

    /////////////////////////////////////////////////////////////////////////////// TS17
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве минут для времени GMT+3.
    // ЕСЛИ число минут < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    if (tmin < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.print(tmin); // МЕТОД Serial.print
    Serial.print(':');  // МЕТОД Serial.print

    /////////////////////////////////////////////////////////////////////////////// TS18
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве секунд для времени GMT+3.
    // ЕСЛИ число секунд < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    if (tsec < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.println(tsec); // МЕТОД Serial.println
    Serial.println();     // МЕТОД Serial.println
  }

  /////////////////////////////////////////////////////////////////////////////// TS19
  // ---------------------------------------------------------------------- delay 3000
  //                                                                       ЗАДАЧА
  // пауза ожидания 3 сек перед новым запросом времени
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  delay(3000);

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // непрерывная световая сигнализация                                              blink
  // управление встроенным светодиодом LED_BUILTIN
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------

  if ((!mode_led && (count_led >= serial1_led)) || (mode_led && (count_led >= serial2_led)))

  // ----------------------------------------------------------------------------
  // обновление настроек
  // при достижении счётчиком серии предельного значения
  // ----------------------------------------------------------------------------

  {
    mode_led = !mode_led;
    flag_led = false;
    count_led = 0;
  }
  else

      if (mode_led)

  // ----------------------------------------------------------------------------
  // серия 2
  // переключение состояния светодиода при mode_led = 1 (500/500)
  // ----------------------------------------------------------------------------

  {
    if (millis() - tmr_led >= 500)
    {
      digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
      tmr_led = millis();
      count_led++;
    }
  }

  else

  // ----------------------------------------------------------------------------
  // серия 1
  // переключение состояния светодиода при mode_led = 0 (30/600)
  // ----------------------------------------------------------------------------

  {
    if ((millis() - tmr_led) >= (flag_led ? 20 : 300))
    {
      digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
      tmr_led = millis();
      flag_led = !flag_led;
      count_led++;
    }
  }

