dastin-alex/esp8266_test/src/main.cpp
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // контроль нажатия встроенной кнопки                                          keypress
  // опрос, обработка состояния встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  state_key = !digitalRead(15);

  // ----------------------------------------------------------------------------
  // нажатие кнопки
  // интервал 100 мс для защиты от дребезга
  // ----------------------------------------------------------------------------

  if (state_key && !flag_key && millis() - tmr_key > 100)

  {
    flag_key = true;
    tmr_key = millis();
    Serial.println("short click");
  }

  // ----------------------------------------------------------------------------
  // нажатие кнопки
  // интервал 500 мс для контроля удержания
  // ----------------------------------------------------------------------------

  if (state_key && flag_key && millis() - tmr_key > 500)

    Serial.println("long click");

  // ----------------------------------------------------------------------------
  // отпускание кнопки
  // интервал 100 мс для защиты от дребезга
  // ----------------------------------------------------------------------------

  if (!state_key && flag_key && millis() - tmr_key > 100)

  {
    flag_key = false;
    tmr_key = millis();
  }
}
